src/cfe/Kyporos.УправлениеДоступомПользователей/src/InformationRegisters/КП_ПараметрыСистемыУправленияДоступомПользователей/КП_ПараметрыСистемыУправленияДоступомПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_ПараметрыСистемыУправленияДоступомПользователей</name>
  <resources>
    <name>VKTeams_АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>VKTeams_ИспользоватьУведомления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>VKTeams_ТокенБота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>VKTeams_ЧатИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресВебСервисаКупорос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь1СДляВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль1СДляВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИД_ТекущейСистемы</name>
    <comment>Должен быть уникальным в рамках одной сети</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтключатьПользователейДобавленныхВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьДопВариантПоискаПоФИО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалятьПраваПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/cfe/Kyporos.УправлениеДоступомПользователей/src/CommonModules/КП_УправлениеБотомVKTeams/Module.bsl
#Область ПрограммныйИнтерфейс

// Отправить сообщение в группу Управление доступом пользователей
//
// Параметры:
//  ТекстСообщения	 - Строка - произвольный текст
//
Процедура ОтправитьСообщениеВГруппуУправлениеДоступомПользователей(ТекстСообщения) Экспорт
	
	ПараметрыРасширения = РегистрыСведений.КП_ПараметрыСистемыУправленияДоступомПользователей.Параметры();	
	
	Если Не ПараметрыРасширения.VKTeams_ИспользоватьУведомления Тогда
		Возврат;
	КонецЕсли;
	
	ЧатИД = ПараметрыРасширения.VKTeams_ЧатИД;
	ИД_ТекущейСистемы = ПараметрыРасширения.ИД_ТекущейСистемы;
	
	ТекстСообщения = СтрШаблон(НСтр("ru = '[%1-%2]: %3'"), Метаданные.Синоним, ИД_ТекущейСистемы, ТекстСообщения);
	
	ОтправитьСообщение(ЧатИД, ТекстСообщения);
	 
КонецПроцедуры 

// Отправить сообщение на канал VK Teams
// Бот должен быть добавлен на канале.
//
// Параметры:
//  ЧатИД			 - Строка	 - Идентификатор чата
//  ТекстСообщения	 - Строка - произвольный текст
//
Процедура ОтправитьСообщение(ЧатИД, ТекстСообщения) Экспорт
	
	ПараметрыРасширения = РегистрыСведений.КП_ПараметрыСистемыУправленияДоступомПользователей.Параметры();
	
	Если Не ПараметрыРасширения.VKTeams_ИспользоватьУведомления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыРасширения.VKTeams_АдресСервера) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен адрес сервера VK Teams.'"));
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = СтрШаблон("/bot/v1/messages/sendText?token=%1&chatId=%2&text=%3", 
		ПараметрыРасширения.VKTeams_ТокенБота, ЧатИД, ТекстСообщения);
	
	Попытка
	
		РезультатЗапроса = КП_ОбщегоНазначенияКупорос.ВыполнитьЗапросHTTP(ПараметрыРасширения.VKTeams_АдресСервера, ТекстЗапроса, "GET"); 	
	
	Исключение
		
		ТекстОшибки = НСтр("ru = 'Ошибка при выполнение запроса HTTP на канал %1.'"); 
		ТекстОшибки = СтрШаблон(ТекстОшибки, ЧатИД);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
		КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная("КП_ВнешнееУправлениеДоступом.ОтправитьСообщение", 
				ТекстОшибки, 
				УровеньЖурналаРегистрации.Ошибка,
				Истина);
				
		Возврат;
		
	КонецПопытки;
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
	
		 ТекстОшибки = НСтр("ru = 'Ошибка при отправке сообщения на канал %1. Код состояния: %2'"); 
		 ТекстОшибки = СтрШаблон(ТекстОшибки, ЧатИД, РезультатЗапроса.КодСостояния);
		 ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		 
		 КП_ОбщегоНазначенияКупорос.ЗаписьЖурналаРегистрацииРасширенная("КП_ВнешнееУправлениеДоступом.ОтправитьСообщение", 
		 		ТекстОшибки, 
		 		УровеньЖурналаРегистрации.Ошибка);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
